wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "rom/ets_sys.h"

#include "ev/esp8266_port_adapters.h"

/*
 * Zero-heap ESP8266 I2C master.
 *
 * The ESP8266 RTOS SDK command-link API allocates command descriptors from the
 * heap through command-link creation.  This adapter intentionally does not install or
 * use the SDK I2C command-link driver.  It owns one bootstrap-time mutex and a
 * bounded GPIO open-drain software master for all runtime transactions.
 */
#define EV_I2C_MAX_COMMANDS_PER_TRANSACTION 16U

#define EV_ESP8266_I2C_CMD_TIMEOUT_MS 150U
#define EV_ESP8266_I2C_TRANSACTION_TIMEOUT_US ((int64_t)EV_ESP8266_I2C_CMD_TIMEOUT_MS * 1000LL)
#define EV_ESP8266_I2C_MUTEX_TIMEOUT_MS 250U
#define EV_ESP8266_I2C_MUTEX_TIMEOUT_TICKS pdMS_TO_TICKS(EV_ESP8266_I2C_MUTEX_TIMEOUT_MS)
#define EV_ESP8266_I2C_HALF_PERIOD_US 5U
#define EV_ESP8266_I2C_CLOCK_STRETCH_TIMEOUT_US 300U
#define EV_ESP8266_I2C_RECOVERY_PULSES 9U
#define EV_ESP8266_I2C_MAX_PAYLOAD_BYTES 64U

#define EV_ESP8266_I2C_WRITE_STREAM_COMMANDS 4U
#define EV_ESP8266_I2C_WRITE_REGS_COMMANDS 5U
#define EV_ESP8266_I2C_READ_REGS_COMMANDS 8U

#if EV_ESP8266_I2C_WRITE_STREAM_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for write_stream"
#endif
#if EV_ESP8266_I2C_WRITE_REGS_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for write_regs"
#endif
#if EV_ESP8266_I2C_READ_REGS_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for read_regs"
#endif

static const char *const k_ev_i2c_tag = "ev_i2c";

typedef struct ev_esp8266_i2c_adapter_ctx {
    ev_i2c_port_num_t port_num;
    int sda_pin;
    int scl_pin;
    bool configured;
    uint32_t transactions_started;
    uint32_t transactions_failed;
    uint32_t nacks;
    uint32_t timeouts;
    uint32_t bus_locked;
    uint32_t bus_recoveries;
    uint32_t bus_recovery_failures;
} ev_esp8266_i2c_adapter_ctx_t;

static SemaphoreHandle_t g_ev_i2c_bus_mutex = NULL;
static ev_esp8266_i2c_adapter_ctx_t g_ev_i2c0_ctx = {
    .port_num = EV_I2C_PORT_NUM_0,
    .sda_pin = -1,
    .scl_pin = -1,
    .configured = false,
};

static bool ev_esp8266_i2c_pin_is_valid(int pin)
{
    /*
     * GPIO16 is intentionally rejected for I2C.  On ESP8266 it is not a normal
     * GPIO matrix pin and is also a common deep-sleep wake line, so using it as
     * open-drain I2C would violate the BSP/power assumptions.
     */
    return (pin >= 0) && (pin <= 15);
}

static bool ev_esp8266_i2c_txn_is_valid(const ev_esp8266_i2c_adapter_ctx_t *ctx,
                                        ev_i2c_port_num_t port_num,
                                        uint8_t device_address_7bit)
{
    return (ctx != NULL) && ctx->configured && (ctx->port_num == port_num) && (device_address_7bit <= 0x7FU);
}

static bool ev_esp8266_i2c_payload_len_is_valid(size_t data_len)
{
    return data_len <= EV_ESP8266_I2C_MAX_PAYLOAD_BYTES;
}

static ev_i2c_status_t ev_esp8266_i2c_record_status(ev_esp8266_i2c_adapter_ctx_t *ctx, ev_i2c_status_t status)
{
    if ((ctx != NULL) && (status != EV_I2C_OK)) {
        ++ctx->transactions_failed;
        switch (status) {
        case EV_I2C_ERR_TIMEOUT:
            ++ctx->timeouts;
            break;
        case EV_I2C_ERR_NACK:
            ++ctx->nacks;
            break;
        case EV_I2C_ERR_BUS_LOCKED:
        default:
            ++ctx->bus_locked;
            break;
        }
    }

    return status;
}

static void ev_esp8266_i2c_release_sda(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->sda_pin, 1);
}

static void ev_esp8266_i2c_release_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->scl_pin, 1);
}

static void ev_esp8266_i2c_drive_sda_low(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->sda_pin, 0);
}

static void ev_esp8266_i2c_drive_scl_low(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->scl_pin, 0);
}

static bool ev_esp8266_i2c_sample_sda(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    return gpio_get_level((gpio_num_t)ctx->sda_pin) != 0;
}

static bool ev_esp8266_i2c_sample_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    return gpio_get_level((gpio_num_t)ctx->scl_pin) != 0;
}

static bool ev_esp8266_i2c_deadline_expired(int64_t started_us)
{
    return (esp_timer_get_time() - started_us) >= EV_ESP8266_I2C_TRANSACTION_TIMEOUT_US;
}

static ev_i2c_status_t ev_esp8266_i2c_wait_scl_high(const ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    uint32_t waited_us = 0U;

    while (!ev_esp8266_i2c_sample_scl(ctx)) {
        if (ev_esp8266_i2c_deadline_expired(started_us) ||
            (waited_us >= EV_ESP8266_I2C_CLOCK_STRETCH_TIMEOUT_US)) {
            return EV_I2C_ERR_TIMEOUT;
        }

        ets_delay_us(1U);
        ++waited_us;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_raise_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    if (ev_esp8266_i2c_deadline_expired(started_us)) {
        return EV_I2C_ERR_TIMEOUT;
    }

    ev_esp8266_i2c_release_scl(ctx);
    status = ev_esp8266_i2c_wait_scl_high(ctx, started_us);
    if (status != EV_I2C_OK) {
        return status;
    }

    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    return EV_I2C_OK;
}

static void ev_esp8266_i2c_lower_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    ev_esp8266_i2c_drive_scl_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
}

static void ev_esp8266_i2c_release_bus_lines(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    ev_esp8266_i2c_release_sda(ctx);
    ev_esp8266_i2c_release_scl(ctx);
}

static ev_i2c_status_t ev_esp8266_i2c_recover_bus(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    uint8_t pulse;

