wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
    if (ctx == NULL) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    ++ctx->bus_recoveries;

    ev_esp8266_i2c_release_sda(ctx);
    ev_esp8266_i2c_release_scl(ctx);

    for (pulse = 0U; pulse < EV_ESP8266_I2C_RECOVERY_PULSES; ++pulse) {
        ev_i2c_status_t status;

        status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ++ctx->bus_recovery_failures;
            return status;
        }

        if (ev_esp8266_i2c_sample_sda(ctx)) {
            break;
        }

        ev_esp8266_i2c_lower_scl(ctx);
    }

    ev_esp8266_i2c_drive_sda_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ev_esp8266_i2c_release_bus_lines(ctx);
            ++ctx->bus_recovery_failures;
            return status;
        }
    }

    ev_esp8266_i2c_release_sda(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    if (!ev_esp8266_i2c_sample_sda(ctx) || !ev_esp8266_i2c_sample_scl(ctx)) {
        ++ctx->bus_recovery_failures;
        return EV_I2C_ERR_BUS_LOCKED;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_prepare_bus(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    ev_esp8266_i2c_release_bus_lines(ctx);
    status = ev_esp8266_i2c_wait_scl_high(ctx, started_us);
    if (status != EV_I2C_OK) {
        return status;
    }

    if (ev_esp8266_i2c_sample_sda(ctx)) {
        return EV_I2C_OK;
    }

    return ev_esp8266_i2c_recover_bus(ctx, started_us);
}

static ev_i2c_status_t ev_esp8266_i2c_start_condition(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    ev_esp8266_i2c_release_sda(ctx);
    ev_esp8266_i2c_release_scl(ctx);

    status = ev_esp8266_i2c_wait_scl_high(ctx, started_us);
    if (status != EV_I2C_OK) {
        return status;
    }

    if (!ev_esp8266_i2c_sample_sda(ctx)) {
        status = ev_esp8266_i2c_recover_bus(ctx, started_us);
        if (status != EV_I2C_OK) {
            return status;
        }
    }

    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    ev_esp8266_i2c_drive_sda_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    ev_esp8266_i2c_drive_scl_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_stop_condition(const ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    ev_esp8266_i2c_drive_sda_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    status = ev_esp8266_i2c_raise_scl(ctx, started_us);
    if (status != EV_I2C_OK) {
        ev_esp8266_i2c_release_sda(ctx);
        return status;
    }

    ev_esp8266_i2c_release_sda(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    if (!ev_esp8266_i2c_sample_sda(ctx)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_write_byte(const ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                  uint8_t value,
                                                  int64_t started_us)
{
    uint8_t bit_index;

    for (bit_index = 0U; bit_index < 8U; ++bit_index) {
        ev_i2c_status_t status;

        if ((value & 0x80U) != 0U) {
            ev_esp8266_i2c_release_sda(ctx);
        } else {
            ev_esp8266_i2c_drive_sda_low(ctx);
        }

        status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ev_esp8266_i2c_release_sda(ctx);
            return status;
        }

        ev_esp8266_i2c_lower_scl(ctx);
        value = (uint8_t)(value << 1U);
    }

    ev_esp8266_i2c_release_sda(ctx);

    {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        bool acked;

        if (status != EV_I2C_OK) {
            return status;
        }

        acked = !ev_esp8266_i2c_sample_sda(ctx);
        ev_esp8266_i2c_lower_scl(ctx);

        return acked ? EV_I2C_OK : EV_I2C_ERR_NACK;
    }
}

static ev_i2c_status_t ev_esp8266_i2c_read_byte(const ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                 uint8_t *out_value,
                                                 bool ack_after_byte,
                                                 int64_t started_us)
{
    uint8_t value = 0U;
    uint8_t bit_index;

    ev_esp8266_i2c_release_sda(ctx);

    for (bit_index = 0U; bit_index < 8U; ++bit_index) {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            return status;
        }

        value = (uint8_t)(value << 1U);
        if (ev_esp8266_i2c_sample_sda(ctx)) {
            value = (uint8_t)(value | 0x01U);
        }

        ev_esp8266_i2c_lower_scl(ctx);
    }

    if (ack_after_byte) {
        ev_esp8266_i2c_drive_sda_low(ctx);
    } else {
        ev_esp8266_i2c_release_sda(ctx);
    }

    {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ev_esp8266_i2c_release_sda(ctx);
            return status;
        }
    }

    ev_esp8266_i2c_lower_scl(ctx);
    ev_esp8266_i2c_release_sda(ctx);

    *out_value = value;
    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_write_payload(const ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                     const uint8_t *data,
                                                     size_t data_len,
                                                     int64_t started_us)
{
    size_t offset;

    for (offset = 0U; offset < data_len; ++offset) {
        ev_i2c_status_t status = ev_esp8266_i2c_write_byte(ctx, data[offset], started_us);
        if (status != EV_I2C_OK) {
            return status;
        }
    }

    return EV_I2C_OK;
}

/*
 * Shared-bus timing policy:
 * - transaction timeout must tolerate one bounded OLED page-chunk transfer,
 * - mutex timeout must be longer than one command budget so slower bulk OLED
 *   flushes do not starve MCP23008/RTC access behind a too-aggressive bus lock
 *   window,
 * - runtime transactions never allocate heap memory; only the bootstrap mutex is
 *   allocated before the application runtime starts.
 */
static ev_i2c_status_t ev_esp8266_i2c_take_bus(void)
{
    if (g_ev_i2c_bus_mutex == NULL) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    if (xSemaphoreTake(g_ev_i2c_bus_mutex, EV_ESP8266_I2C_MUTEX_TIMEOUT_TICKS) != pdTRUE) {
        return EV_I2C_ERR_TIMEOUT;
    }

    return EV_I2C_OK;
}

static void ev_esp8266_i2c_give_bus(void)
{
    if (g_ev_i2c_bus_mutex != NULL) {
        (void)xSemaphoreGive(g_ev_i2c_bus_mutex);
    }
}

static ev_i2c_status_t ev_esp8266_i2c_begin_locked(ev_esp8266_i2c_adapter_ctx_t *adapter, int64_t *out_started_us)
{
    int64_t started_us;
    ev_i2c_status_t status;

