wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
    if ((adapter == NULL) || (out_started_us == NULL)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    started_us = esp_timer_get_time();
    *out_started_us = started_us;

    status = ev_esp8266_i2c_prepare_bus(adapter, started_us);
    if (status == EV_I2C_OK) {
        ++adapter->transactions_started;
    }

    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_finish_locked(ev_esp8266_i2c_adapter_ctx_t *adapter,
                                                    bool started,
                                                    int64_t started_us,
                                                    ev_i2c_status_t status)
{
    if (started) {
        const ev_i2c_status_t stop_status = ev_esp8266_i2c_stop_condition(adapter, started_us);
        if (status == EV_I2C_OK) {
            status = stop_status;
        }
    }

    ev_esp8266_i2c_release_bus_lines(adapter);
    return ev_esp8266_i2c_record_status(adapter, status);
}

static ev_i2c_status_t ev_esp8266_i2c_write_stream(void *ctx,
                                                    ev_i2c_port_num_t port_num,
                                                    uint8_t device_address_7bit,
                                                    const uint8_t *data,
                                                    size_t data_len)
{
    ev_esp8266_i2c_adapter_ctx_t *adapter = (ev_esp8266_i2c_adapter_ctx_t *)ctx;
    ev_i2c_status_t status;
    int64_t started_us = 0;
    bool started = false;

    if (!ev_esp8266_i2c_txn_is_valid(adapter, port_num, device_address_7bit)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }
    if (((data_len > 0U) && (data == NULL)) || !ev_esp8266_i2c_payload_len_is_valid(data_len)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    status = ev_esp8266_i2c_take_bus();
    if (status != EV_I2C_OK) {
        return ev_esp8266_i2c_record_status(adapter, status);
    }

    status = ev_esp8266_i2c_begin_locked(adapter, &started_us);
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        started = true;
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 0U), started_us);
    }
    if ((status == EV_I2C_OK) && (data_len > 0U)) {
        status = ev_esp8266_i2c_write_payload(adapter, data, data_len, started_us);
    }

    status = ev_esp8266_i2c_finish_locked(adapter, started, started_us, status);
    ev_esp8266_i2c_give_bus();
    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_write_regs(void *ctx,
                                                  ev_i2c_port_num_t port_num,
                                                  uint8_t device_address_7bit,
                                                  uint8_t first_reg,
                                                  const uint8_t *data,
                                                  size_t data_len)
{
    ev_esp8266_i2c_adapter_ctx_t *adapter = (ev_esp8266_i2c_adapter_ctx_t *)ctx;
    ev_i2c_status_t status;
    int64_t started_us = 0;
    bool started = false;

    if (!ev_esp8266_i2c_txn_is_valid(adapter, port_num, device_address_7bit)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }
    if (((data_len > 0U) && (data == NULL)) || !ev_esp8266_i2c_payload_len_is_valid(data_len)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    status = ev_esp8266_i2c_take_bus();
    if (status != EV_I2C_OK) {
        return ev_esp8266_i2c_record_status(adapter, status);
    }

    status = ev_esp8266_i2c_begin_locked(adapter, &started_us);
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        started = true;
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 0U), started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_write_byte(adapter, first_reg, started_us);
    }
    if ((status == EV_I2C_OK) && (data_len > 0U)) {
        status = ev_esp8266_i2c_write_payload(adapter, data, data_len, started_us);
    }

    status = ev_esp8266_i2c_finish_locked(adapter, started, started_us, status);
    ev_esp8266_i2c_give_bus();
    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_read_regs(void *ctx,
                                                 ev_i2c_port_num_t port_num,
                                                 uint8_t device_address_7bit,
                                                 uint8_t first_reg,
                                                 uint8_t *data,
                                                 size_t data_len)
{
    ev_esp8266_i2c_adapter_ctx_t *adapter = (ev_esp8266_i2c_adapter_ctx_t *)ctx;
    ev_i2c_status_t status;
    int64_t started_us = 0;
    size_t offset;
    bool started = false;

    if (!ev_esp8266_i2c_txn_is_valid(adapter, port_num, device_address_7bit)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }
    if ((data == NULL) || (data_len == 0U) || !ev_esp8266_i2c_payload_len_is_valid(data_len)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    status = ev_esp8266_i2c_take_bus();
    if (status != EV_I2C_OK) {
        return ev_esp8266_i2c_record_status(adapter, status);
    }

    status = ev_esp8266_i2c_begin_locked(adapter, &started_us);
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        started = true;
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 0U), started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_write_byte(adapter, first_reg, started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 1U), started_us);
    }

    for (offset = 0U; (status == EV_I2C_OK) && (offset < data_len); ++offset) {
        const bool ack_after_byte = (offset + 1U) < data_len;
        status = ev_esp8266_i2c_read_byte(adapter, &data[offset], ack_after_byte, started_us);
    }

    status = ev_esp8266_i2c_finish_locked(adapter, started, started_us, status);
    ev_esp8266_i2c_give_bus();
    return status;
}

static const char *ev_esp8266_i2c_known_device_name(uint8_t device_address_7bit)
{
    if (device_address_7bit == 0x68U) {
        return "rtc";
    }
    if ((device_address_7bit >= 0x20U) && (device_address_7bit <= 0x27U)) {
        return "mcp23008";
    }
    if ((device_address_7bit == 0x3CU) || (device_address_7bit == 0x3DU)) {
        return "oled";
    }
    return NULL;
}

