wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
static ev_esp8266_i2c_adapter_ctx_t *ev_esp8266_i2c_ctx_from_port(ev_i2c_port_num_t port_num)
{
    if (port_num == EV_I2C_PORT_NUM_0) {
        return &g_ev_i2c0_ctx;
    }
    return NULL;
}

ev_result_t ev_i2c_scan(ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);
    bool found_any = false;
    bool found_rtc = false;
    bool found_oled = false;
    bool found_mcp = false;
    uint8_t device_address_7bit;

    if (ctx == NULL) {
        return EV_ERR_UNSUPPORTED;
    }
    if (!ctx->configured) {
        return EV_ERR_STATE;
    }

    ESP_LOGI(k_ev_i2c_tag,
             "i2c-scan: start port=%u SDA=%d SCL=%d",
             (unsigned)port_num,
             ctx->sda_pin,
             ctx->scl_pin);

    for (device_address_7bit = 0x03U; device_address_7bit < 0x78U; ++device_address_7bit) {
        ev_i2c_status_t status = ev_esp8266_i2c_write_stream(ctx, port_num, device_address_7bit, NULL, 0U);

        if (status == EV_I2C_OK) {
            const char *device_name = ev_esp8266_i2c_known_device_name(device_address_7bit);
            found_any = true;

            if (device_address_7bit == 0x68U) {
                found_rtc = true;
            }
            if ((device_address_7bit >= 0x20U) && (device_address_7bit <= 0x27U)) {
                found_mcp = true;
            }
            if ((device_address_7bit == 0x3CU) || (device_address_7bit == 0x3DU)) {
                found_oled = true;
            }

            if (device_name != NULL) {
                ESP_LOGI(k_ev_i2c_tag,
                         "i2c-scan: found 0x%02X (%s)",
                         (unsigned)device_address_7bit,
                         device_name);
            } else {
                ESP_LOGI(k_ev_i2c_tag, "i2c-scan: found 0x%02X", (unsigned)device_address_7bit);
            }
        }
    }

    if (!found_any) {
        ESP_LOGW(k_ev_i2c_tag, "i2c-scan: no devices acknowledged");
    }
    if (found_rtc) {
        ESP_LOGI(k_ev_i2c_tag, "rtc-probe: detected device at 0x68");
    } else {
        ESP_LOGW(k_ev_i2c_tag, "rtc-probe: no response at 0x68");
    }
    if (found_mcp) {
        ESP_LOGI(k_ev_i2c_tag, "mcp23008-probe: detected device in range 0x20-0x27");
    } else {
        ESP_LOGW(k_ev_i2c_tag, "mcp23008-probe: no response in range 0x20-0x27");
    }
    if (found_oled) {
        ESP_LOGI(k_ev_i2c_tag, "oled-probe: detected device at 0x3C or 0x3D");
    } else {
        ESP_LOGI(k_ev_i2c_tag, "oled-probe: optional OLED not detected");
    }

    return EV_OK;
}

ev_result_t ev_esp8266_i2c_port_init(ev_i2c_port_t *out_port, int sda_pin, int scl_pin)
{
    gpio_config_t sdk_cfg = {0};
    esp_err_t sdk_rc;
    ev_i2c_status_t bus_status;

    if ((out_port == NULL) || !ev_esp8266_i2c_pin_is_valid(sda_pin) || !ev_esp8266_i2c_pin_is_valid(scl_pin) ||
        (sda_pin == scl_pin)) {
        return EV_ERR_INVALID_ARG;
    }

    if (g_ev_i2c_bus_mutex == NULL) {
        g_ev_i2c_bus_mutex = xSemaphoreCreateMutex();
        if (g_ev_i2c_bus_mutex == NULL) {
            ESP_LOGE(k_ev_i2c_tag, "bus mutex allocation failed");
            return EV_ERR_STATE;
        }
    }

    sdk_cfg.pin_bit_mask = (1ULL << (unsigned)sda_pin) | (1ULL << (unsigned)scl_pin);
    sdk_cfg.mode = GPIO_MODE_OUTPUT_OD;
    sdk_cfg.pull_up_en = GPIO_PULLUP_ENABLE;
    sdk_cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
    sdk_cfg.intr_type = GPIO_INTR_DISABLE;

    sdk_rc = gpio_config(&sdk_cfg);
    if (sdk_rc != ESP_OK) {
        ESP_LOGE(k_ev_i2c_tag, "gpio_config for zero-heap i2c failed rc=%d", (int)sdk_rc);
        return EV_ERR_STATE;
    }

    g_ev_i2c0_ctx.port_num = EV_I2C_PORT_NUM_0;
    g_ev_i2c0_ctx.sda_pin = sda_pin;
    g_ev_i2c0_ctx.scl_pin = scl_pin;
    g_ev_i2c0_ctx.configured = true;
    g_ev_i2c0_ctx.transactions_started = 0U;
    g_ev_i2c0_ctx.transactions_failed = 0U;
    g_ev_i2c0_ctx.nacks = 0U;
    g_ev_i2c0_ctx.timeouts = 0U;
    g_ev_i2c0_ctx.bus_locked = 0U;
    g_ev_i2c0_ctx.bus_recoveries = 0U;
    g_ev_i2c0_ctx.bus_recovery_failures = 0U;

    ev_esp8266_i2c_release_bus_lines(&g_ev_i2c0_ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    bus_status = ev_esp8266_i2c_prepare_bus(&g_ev_i2c0_ctx, esp_timer_get_time());
    if (bus_status != EV_I2C_OK) {
        ESP_LOGE(k_ev_i2c_tag, "zero-heap i2c bus is not idle after init status=%d", (int)bus_status);
        g_ev_i2c0_ctx.configured = false;
        return EV_ERR_STATE;
    }

    out_port->ctx = &g_ev_i2c0_ctx;
    out_port->write_stream = ev_esp8266_i2c_write_stream;
    out_port->write_regs = ev_esp8266_i2c_write_regs;
    out_port->read_regs = ev_esp8266_i2c_read_regs;

    return EV_OK;
}
